"""
39. Даны два массива чисел. Требуется вывести те элементы первого массива (в том порядке, в каком они идут в первом массиве),
которых нет во втором массиве. Пользователь вводит число N - количество элементов в первом массиве,
затем N чисел - элементы массива. Затем число M - количество элементов во втором массиве. Затем элементы второго массива


41. Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве определит количество элементов,
у которых два соседних и, при этом, оба соседних элемента меньше данного. Сначала вводится число N — количество элементов
в массиве Далее записаны N чисел — элементы массива. Массив состоит из целых чисел.


43. Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента,
равные друг другу образуют одну пару, которую необходимо посчитать.
Вводится список чисел. Все числа списка находятся на разных строках.


45. Два различных натуральных числа n и m называются дружественными, если сумма делителей числа n (включая 1, но исключая само n)
равна числу m и наоборот. Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел,
каждое из которых не превосходит k. Программа получает на вход одно натуральное число k, не превосходящее 105. Программа должна
вывести  все пары дружественных чисел, каждое из которых не превосходит k. Пары необходимо выводить по одной в строке, разделяя
пробелами. Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает).
"""
import random

# Task 39.

# import random
#
# user_list_one = [random.randint(0, 20) for _ in range(7)]
# user_list_two = [random.randint(0, 20) for _ in range(6)]
# print(user_list_one)
# print(user_list_two)
#
# result_list = list()
#
# for i in user_list_one:
#     for j in user_list_two:
#         if j != i:
#             result_list.append(i)
#
# result_list = set(result_list)
#
# print(result_list)


# Task 41.

# user_list = [random.randint(1, 10) for _ in range(15)]
# print(user_list)
#
# count = 0
#
# for i in range(2, len(user_list) - 1):
#     if user_list[i] > user_list[i - 1] and user_list[i] > user_list[i + 1]:
#         count += 1
#
# print(count)



# Task 43.

# array = [1, 2, 3, 4, 1, 2, 4, 6, 6, 6]
#
# array_1 = list()
#
# for i in array:
#     if array.count(i) > 1:
#         array_1.append(i)
#
# array_1 = set(array_1)
#
# print(len(array_1))

# Task 45.











